/**
 *Προσοχή στα ονόματα που δίνετε στις μεταβλητές σας. Εκτός από το ότι θα πρέπει:
 *  1) να είναι camelCase, 2) θα πρέπει να έχουν και σημασιολογία.
 *  Δηλαδή τα ονόματα των μεταβλητών θα πρέπει να είναι τέτοια,
 *  ώστε να καταλαβαίνουμε διαβάζοντάς τα το ΤΙ αποθηκεύουν. Επομένως,
 *  αν θέλουμε να αποθηκεύσουμε βαθμούς Φαρενάιτ, το όνομα της μεταβλητής καλύτερα να είναι fahrenheit και όχι f, num1
 *  και σίγουρα όχι F ή οτιδήποτε δεν έχει σημασιολογία. Το ίδιο ισχύει και για τους βαθμούς Κελσίου, καλύτερα να είναι celsius
 *  και όχι c, num2 κλπ.
 *
 * Προσοχή στο να τηρείτε τη βασική δομή ενός προγράμματος.
 * 1) Δήλωση και αρχικοποίηση μεταβλητών, 2) Εντολές, 3) Εκτύπωση αποτελεσμάτων.
 *
 * Αυτό σημαίνει επίσης, ότι στις δηλώσεις θα πρέπει να αρχικοποιούμε
 * σε ουδέτερες τιμές και όχι κατευθείαν σε τιμές που λαμβάνουμε
 * από το stdin. Επομένως, καλύτερα να δηλώνουμε
 *
 * int fahreheit = 0;
 *
 * και όχι
 *
 * int fahrenheit = scanner.nextInt();
 *
 * Μην αφήνετε πολλές κενές γραμμές. Αφήνετε προαιρετικά μία κενή γραμμή πριν τη main και μία γραμμή πριν από comments.
 *
 * Γράφετε doc comments με τον σκοπό της κλάσης. Δε χρειάζεται να αναφέρετε
 * στα doc comments τον τρόπο που υλοποιείται την κλάση σας.
 *
 * Μην αφήνετε κενή γραμμή μετά τα doc comments και πριν την κλάση.
 *
 * Χρησιμοποιείται την print ή println για να εκτυπώνεται απλό κείμενο
 *
 * Μπορείτε να χρησιμοποιείτε την printf για να εκτυπώσετε κείμενο μαζί με μεταβλητές.
 * Με printf μπορείτε να χρησιμοποιείτε και UTF-8 χαρακτήρες όπως για παράδειγμα το
 * σύμβολο Fahrenheit degrees \u2109 και Celsius degrees \u2103
 *
 * System.out.printf("%d\u2109 = %d\u2103\n", fahrenheit, celsius);
 */